Repository: vakesz/Glasstual
Catalog: Sources/App/Features/ServerChannelList/ServerChannelList.xcstrings
Source language: en
Languages: de, hu

# change-the-search-or-update
source: Change the search or update the list from the server.
de: Ändere die Suche oder aktualisiere die Liste vom Server.
hu: Módosítsd a keresést, vagy frissítsd a listát a kiszolgálóról.

source: Channel Name
de: Kanalname
hu: Csatornanév

source: Join Selected Channels
de: Ausgewählten Kanälen beitreten
hu: Csatlakozás a kijelölt csatornákhoz

# list-truncated-notice
source: The server sent more channels than this window keeps; the first %ld are here. Narrow the search on the server to see the rest.
de: Der Server hat mehr Kanäle gesendet, als dieses Fenster speichert. Hier werden die ersten %ld angezeigt. Grenze die Suche auf dem Server ein, um die übrigen zu sehen.
hu: A kiszolgáló több csatornát küldött, mint amennyit ez az ablak megőriz. Itt az első %ld látható. A többi megtekintéséhez szűkítsd a kiszolgálón végzett keresést.

source: Member Count
de: Mitgliederzahl
hu: Tagok száma

source: Minimum users
de: Mindestanzahl Benutzer
hu: Minimális taglétszám

source: No Channel List
de: Keine Kanalliste
hu: Nincs csatornalista

# no-channel-list-description
source: Ask a server for its public channels from the Server menu.
de: Frage über das Servermenü die öffentlichen Kanäle eines Servers ab.
hu: A Kiszolgáló menüből kérheted le egy kiszolgáló nyilvános csatornáit.

source: No Public Channels
de: Keine öffentlichen Kanäle
hu: Nincsenek nyilvános csatornák

# only-list-channels-with-at-least
source: The server applies this filter, so smaller channels are never sent.
de: Der Server wendet diesen Filter an. Kleinere Kanäle werden daher nicht gesendet.
hu: Ezt a szűrőt a kiszolgáló alkalmazza, így a kisebb csatornákat nem küldi el.

# public-channel-count
source: %ld public channels
de: %ld öffentliche Kanäle
hu: %ld nyilvános csatorna

source: Public Channel List
de: Öffentliche Kanalliste
hu: Nyilvános csatornák listája

source: Requesting channel list…
de: Kanalliste wird angefordert…
hu: Csatornalista lekérése…

source: Search channels
de: Kanäle suchen
hu: Csatornák keresése

source: Topic
de: Thema
hu: Téma

# update-list
source: Refresh
de: Aktualisieren
hu: Frissítés

# window-group-title
source: Channel List
de: Kanalliste
hu: Csatornalista
